{
  "basics": {
    "name": "Nathanaël Derousseaux",
    "label": "Ingénieur DevOps",
    "image": "https://gravatar.com/avatar/561e6d4e74d7f8c5fb5b89606c4319e822d8f70856cf859a17cad0a0b2916072?s=2048",
    "email": "n.derousseaux@icloud.com",
    "phone": "+33 6 20 00 46 28",
    "url": "https://nathanaelderousseaux.fr",
    "summary": "Je suis diplômé d'un master en sécurité des systèmes et des réseaux, ainsi que d'une licence professionnelle en développement web / DevOps. Ce double cursus m'a permis d'appréhender, aussi bien le développement d'applications web, que l'environnement dans lequel ces applications évoluent.\nC'est pourquoi je recherche aujourd'hui un poste de DevOps, où mes compétences en développement et en gestion de systèmes pourraient permettre d'optimiser les processus de développement et de déploiement.\nJe suis particulièrement intéressé par les missions qui me permettraient d'automatiser les déploiements, d'améliorer la sécurité, d'optimiser les performances ou d'exploiter les services cloud.",
    "location": {
      "postalCode": "67000",
      "city": "Strasbourg",
      "region": "France"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "nderousseaux",
        "url": "https://www.linkedin.com/in/nderousseaux/"
      },
      {
        "network": "GitHub",
        "username": "nderousseaux",
        "url": "https://github.com/nderousseaux"
      }
    ]
  },


  "work": [
    {
      "company": "IMT Atlantique",
      "position": "Stagiaire chercheur sécurité blockchain",
      "startDate": "2024-02-01",
      "endDate": "2024-08-01",
      "summary": "Stage de recherche dans le laboratoire SOTERN d'IMT Atlantique à Rennes. Encadré par trois chercheurs. Cette expérience m'a permis d'approfondir très sérieusement mes compétences en mathématiques, notemment en probabilités, en théorie de graphes et en cryptographie. Cela a aussi été l'occasion de me perfectionner en calcul scientifique avec scipy.",
      "highlights": [
        "Développement d'un algorithme de compression des blockchains permettant de réduire considérablement leur taille, tout en sauvegardant leurs propriétés de sécurité. Écriture d'un article sur le sujet.",
        "Création d'un simulateur permettant de valider nos résultats théoriques."
      ]
    },
    {
      "company": "l'IUT Robert Schuman",
      "position": "Développeur Full Stack / DevOps",
      "startDate": "2020-06-01",
      "endDate": "2021-09-01",
      "summary": "D'abord en stage, puis en apprentissage, j'ai pu travailler sur le développement et création de pipelines CI/CD sécurisées pour les outils pédagogiques et administratifs pour l'IUT Robert Schuman et pour le CFAU de Mulhouse.",
      "highlights": [
        "Création complète d'une application web de relève des absences. Depuis la caractérisation des besoins du client, jusqu'aux ajustement en production, en passant par le design, le développement backend et frontend et surtout l'automatisation du déploiement sur deux serveurs (test et production).",
        "Ajustements sur une application administrative du Centre de Formation Universitaire (CFAU) de Mulhouse. Développement de nouvelles fonctionnalités et amélioration et sécurisation de la pipeline de déploiement. Intégration d'une étape de test automatisée avec sonarqube et déploiement automatisé sur des serveurs de test et de production."
      ]
    }

  ],


  "volunteer": [{
    "organization": "Eiko",
    "position": "Développeur Web",
    "startDate": "2021-01-01",
    "endDate": "2021-02-01",
    "summary": "Eiko est une association ayant pour but la création d'outils digitaux pour permettre au citoyen de diminuer facilement son empreinte écologique. En collaboration avec l'association I-Boycott.",
    "highlights": [
      "Intégration dans une équipe de développement d'une extension web permettant d'avertir le consommateur d'éventuels boycotts en cours sur un produit.",
      "Ajout de fonctionnalités sur l'extension, amélioration de la pipeline de test, avec sonarqube et eslint."
    ]
  }],


  "education": [
    {
      "institution": "l'Université de Strasbourg",
      "area": "Sciences et Ingénieurie des Réseaux, de l'Internet et des Systèmes",
      "studyType": "Master",
      "startDate": "2022-09-01",
      "endDate": "2024-08-01",
      "summary": "Au cours de mon Master SIRIS (Science et Ingénierie des Réseaux, de l'Internet et des Systèmes), j'ai approfondi mes connaissances dans les infrastructures systèmes et réseaux.Un aspect clé de ma formation a été le déploiement, la maintenance et la surveillance d'applications à grande échelle sur plusieurs serveurs. J'ai appris à concevoir des architectures résiliantes multi-serveurs avec une capacité d'auto-scaling, avec Nomad, Consul, Terraform et Ansible.J'ai aussi pu aborder des concepts tels que l'algorithmique distribuée, les protocoles de routage inter et intra-domaine ou les protocoles de communication sans fil."
    },

    {
      "institution": "l'Université de Strasbourg",
      "area": "Informatique",
      "studyType": "Licence",
      "startDate": "2021-09-01",
      "endDate": "2022-08-01",
      "summary": "Ma Licence Informatique m'a permise d'approfondir mes connaissances en mathématiques appliquées à l'informatique. J'ai pu étudier des domaines tels que la mesure de réseaux et des algorithmes, la compression, le calcul parallèle et approfondir mes connaissances en théorie des graphes. C'est aussi au cours de cette année que nous avons réalisé un projet web d'envergure avec 9 autres étudiants, ou je me suis chargé de processus de tests et de mise en production. Ce projet était entièrement organisé avec la méthodologie SCRUM."
    },

    {
      "institution": "l'Université de Strasbourg",
      "area": "Conception et Développement d'Applications Distribués",
      "studyType": "Licence Professionnelle",
      "startDate": "2020-09-01",
      "endDate": "2021-09-01",
      "summary": "Ce cursus m'a permis d'acquérir des compétences avancées en développement web et en automatisation des processus de déploiements. J'ai été formé à l'utilisation de frameworks web à la fois pour le front-end et le back-end et le mobile, avec React.js, Vue.js, Laravel, Symfony, JavaEE et surtout Flask avec Django et Pyramid. C'est surtout au cours de cette formation que j'ai pu aborder en détails les différents outils du DevOps : Docker, GitLab CI, Sonarqube, et du scripting Python."
    },

    {
      "institution": "l'Université de Strasbourg",
      "area": "Informatique",
      "studyType": "DUT",
      "startDate": "2018-09-01",
      "endDate": "2020-08-01",
      "summary": "Durant mon DUT Informatique j'ai acquis les bases essentielles de l'informatique, du développement aux infrastructures en passant par le cloud. J'ai pu acquérir des bases en programmation python, C, Java, en routage, protocole réseau, et en infrastructure cloud. C'est aussi au cours de cette formation que j'ai pu approcher pour la première fois les méthodologies agile avec SCRUM."
    }
  ],


  "skills": [
    {
      "name": "DevOps tools & Containers",
      "keywords": [
        "Docker",
        "Ansible",
        "GitLab CI",
        "Nomad",
        "Sonarqube",
        "Docker Compose",
        "Terraform",
        "Github Actions",
        "Consul",
        "OpenStack",
        "Prometheus",
        "Grafana"
      ]
    },

    {
      "name": "Développement Front-end",
      "keywords": [
        "Vue.js",
        "React Native",
        "React.js",
        "Symfony"
      ]
    },
    
    {
      "name": "Développement Back-end",
      "keywords": [
        "Flask",
        "Django",
        "Express",
        "Pyramid",
        "SQLAlchemy",
        "Sequelize",
        "JavaEE",
        "Scipy"
      ]
    },

    {
      "name": "Cloud",
      "keywords": [
        "Azure",
        "AWS",
        "Google Cloud"
      ]
    },

    {
      "name": "Bases de données / Big Data",
      "keywords": [
        "Mysql",
        "Oracle",
        "Redis",
        "Mongo DB"
      ]
    },

    {
      "name": "Méthodes",
      "keywords": [
        "Agile Scrum"
      ]
    }
  ],


  "languages": [
    {
      "language": "Français",
      "fluency": "Natif"
    },
    {
      "language": "Anglais",
      "fluency": "B2"
    }
  ],


  "interests": [
    {
      "name": "Hobbies",
      "keywords": [
        "Informatique"
      ]
    },
    {
      "name": "Arts",
      "keywords": [
        "Théatre"
      ]
    },
    {
      "name": "Sports",
      "keywords": [
        "Vélo de randonnée",
        "Trekking",
        "Running",
        "Plongée sous-marine"
      ]
    }
  ],


  "projects": [
    {
      "name": "Structure cloud complète",
      "startDate": "2023-01-01",
      "endDate": "2023-05-01",
      "summary": "Projet dont l'objectif était de mettre en place une infrastructure cloud multi-site résiliente aux pannes et automatiquement scalable en fonction de la demande. L'infrastructure que j'ai mise en place utilisait Ansible, Terraform, Consul, Nomad, Haproxy et KeepAlived. Les applications nécessitaient d'utiliser également certains services du Cloud AWS.",
      "url": "https://github.com/nderousseaux/projet-cloud-virtualisation"
    },
    {
      "name": "Projet étudiant",
      "startDate": "2023-09-01",
      "endDate": "2024-02-01",
      "summary": "Projet étudiant d'envergure dont l'objectif était de créer une application de suivit des récoltes sur une exploitation agricole. Je me suis personnellement occupé de toute la partie déploiement et infrastructure. J'ai utilisé le service OpenStack de l'université pour déployer des machines virtuelles avec hébergeant Consul/Nomad, dont le trafic était réparti à l'aide d'un load balancer Haproxy. J'ai également mis en place un système de monitoring de l'ensemble avec Prometheus.",
      "url": "https://github.com/nderousseaux/projet-master"
    },
    {
      "name": "Carte des stagiaires",
      "startDate": "2024-01-01",
      "endDate": "2024-07-01",
      "summary": "Projet personnel ayant pour but de placer une liste d'entreprises sur une carte. Durant ce projet j'ai utilisé les API google Maps pour convertir des adresses en position sur une carte. J'ai aussi mis en place une pipeline CI/CD en serverless avec Google Cloud Plateform et Github Action.",
      "url": "https://github.com/nderousseaux/internmap"
    }
  ]


}